<!-- 写真を投稿・表示管理を行う「画像投稿」ページ 
1:「タイトル名」「画像」を入力し、画像を投稿することができる。
2: 投稿された画像の「タイトル名」「画像」を一覧で表示する。
3: 一覧から指定した画像の公開フラグを「公開」「非公開」に変更することができる。
4: 画像の投稿もしくは指定した画像の公開フラグが正常に更新された場合、完了のメッセージを表示する。
5: 画像投稿ボタンクリック時、「タイトル名」「画像」が設定されていない場合、エラーメッセージを表示し、画像投稿されない。
6: 投稿できる画像の形式は「JPEG」「PNG」のみとする。「JPEG」「PNG」以外の場合、エラーメッセージを表示し、画像投稿されない。
7: 「ファイル名」は、元のファイル名とは別に、システムが自動でユニークな名前を生成することで、重複しないようにします。
8: 非表示の場合、背景色を変更し、表示・非表示の状態が見てわかるようにする。
9: 画像一覧ページへ遷移する事ができる。
  --> 
<!DOCTYPE html>
<html lang="ja">
<head>
    <meta charset="UTF-8">
    <title>画像投稿</title>
</head>
<body>
  <h1>画像投稿</h1>
    <!-- ここに画像を投稿するコードを追加 -->
</body>
</html>